#include <stdio.h>
#include <math.h>
#include "errors.h"
#include "define.h"
#include "print.h"

void print_error(int rc)
{
    switch (rc)
    {
        case ERROR_IO:
            printf("Ошибка ввода!!!\n");
            break;
        case ERROR_MEM:
            printf("Ошибка памяти!!!\n");
            break;
    }
}

void print_menu(void)
{
        printf("\n");
        printf("    +--------------------------------------------------+\n");
        printf("    |                  МЕНЮ ГРАФА                      |\n");
        printf("    +--------------------------------------------------+\n");
        printf("    | 1 - Ввести острова и пути между ними.            |\n");
        printf("    | 2 - Добавить остров.                             |\n");
        printf("    | 3 - Добавить путь между существующими островами. |\n");
        printf("    | 4 - Проверить связность всех островов.           |\n");
        printf("    | 5 - Вывести все пути между островами.            |\n");
        printf("    | 6 - Собрать статистику.                          |\n");
        printf("    | 7 - Очистить все пути и острова.                 |\n");
        printf("    |~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|\n");
        printf("    | 0 - Выход.                                       |\n");
        printf("    +--------------------------------------------------+\n");
        printf("Выбор: ");
}