#include <stdio.h>
#include <math.h>
#include "errors.h"
#include "define.h"
#include "print.h"

void print_error(int rc)
{
    switch (rc)
    {
        case ERROR_IO:
            printf("Ошибка ввода!!!\n");
            break;
        case ERROR_MEM:
            printf("Ошибка памяти!!!\n");
            break;
    }
}

void print_menu(void)
{
    printf("\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("    |                          ГЛАВНОЕ МЕНЮ                     |\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("    |                          BST-ДЕРЕВО                       |\n");
    printf("    | 01 - Добавить строку в BST-дерево.                        |\n");
    printf("    | 02 - Удалить элемент из BST-дерева.                       |\n");
    printf("    | 03 - Вывести BST-дерево.                                  |\n");
    printf("    | 04 - Поиск элемента в BST-дереве.                         |\n");
    printf("    | 05 - Подсветить повторяющиеся элементы (BST).             |\n");
    printf("    | 06 - Удалить повторяющиеся элементы.                      |\n");
    printf("    | 07 - Очистить BST-дерево.                                 |\n");
    printf("    | 08 - Сбалансировать BST-дерево (построить AVL).           |\n");
    printf("    |                                                           |\n");
    printf("    |                         AVL-ДЕРЕВО                        |\n");
    printf("    | 11 - Добавить строку в AVL-дерево.                        |\n");
    printf("    | 12 - Удалить элемент из AVL-дерева.                       |\n");
    printf("    | 13 - Вывод AVL-дерева.                                    |\n");
    printf("    | 14 - Поиск элемента в AVL-дереве.                         |\n");
    printf("    | 15 - Подсветить повторяющиеся элементы (AVL).             |\n");
    printf("    | 16 - Очистка AVL-дерева.                                  |\n");
    printf("    |                                                           |\n");
    printf("    |                    ХЭШ-ТАБЛИЦА (ЦЕПОЧКИ)                  |\n");
    printf("    | 21 - Добавить строку в хеш-таблицу (цепочки).             |\n");
    printf("    | 22 - Удалить элемент из хеш-таблицы (цепочки).            |\n");
    printf("    | 23 - Поиск элемента в хеш-таблице (цепочки).              |\n");
    printf("    | 24 - Вывод хеш-таблицы (цепочки).                         |\n");
    printf("    | 25 - Реструктуризация (цепочки).                          |\n");
    printf("    | 26 - Очистка хеш-таблицы (цепочки).                       |\n");
    printf("    |                                                           |\n");
    printf("    |              ХЭШ-ТАБЛИЦА (ЛИНЕЙНАЯ АДРЕСАЦИЯ)             |\n");
    printf("    | 31 - Добавить строку в хеш-таблицу (адресация).           |\n");
    printf("    | 32 - Удалить элемент из хеш-таблицы (адресация).          |\n");
    printf("    | 33 - Поиск элемента в хеш-таблице (адресация).            |\n");
    printf("    | 34 - Вывод хеш-таблицы (адресация).                       |\n");
    printf("    | 35 - Реструктуризация (адресация).                        |\n");
    printf("    | 36 - Очистка хеш-таблицы (адресация).                     |\n");
    printf("    |                                                           |\n");
    printf("    |                      СИСТЕМНЫЕ ОПЕРАЦИИ                   |\n");
    printf("    |100 - Замеры производительности (время, память, сравнения).|\n");
    printf("    |~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|\n");
    printf("    |  0 - Выход из программы.                                  |\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("Выбор операции: ");
}