#include <stdio.h>
#include <math.h>
#include "errors.h"
#include "define.h"
#include "print.h"

void print_error(int rc)
{
    switch (rc)
    {
        case ERROR_IO:
            printf("Ошибка ввода!!!\n");
            break;
        case ERROR_MEM:
            printf("Ошибка памяти!!!\n");
            break;
        case ERROR_EMPTY:
            printf("Ошибка удаления из пустого дерева!!!\n");
            break;
    }
}

void print_menu(void)
{
    printf("\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("    |                         МЕНЮ ДЕРЕВА                       |\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("    | 1 - Добавить строку в дерево.                             |\n");
    printf("    | 2 - Удалить элемент из дерева.                            |\n");
    printf("    | 3 - Вывести дерево.                                       |\n");
    printf("    | 4 - Искать элемент в дереве.                              |\n");
    printf("    | 5 - Вывести повторяющиеся элементы.                       |\n");
    printf("    | 6 - Удалить повторяющиеся элементы.                       |\n");
    printf("    | 7 - Очистить дерево.                                      |\n");
    printf("    | 8 - Вывести три вида обхода дерева.                       |\n");
    printf("    | 9 - Сравнение производительности.                         |\n");
    printf("    |~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|\n");
    printf("    | 0 - Выход из программы.                                   |\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("Выбор операции: ");
}