#include <stdio.h>
#include <stdlib.h>
#include "print.h"

// Функция вывода начального меню
void print_main_menu(void)
{
    printf("\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("    |                   Программа работы со стеком              |\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("    | 0 - Выход.                                                |\n");
    printf("    | 1 - Эмуляция стека.                                       |\n");
    printf("    | 2 - Сравнение стеков (массив vs список).                  |\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("Выбор: ");
}

// Функция выбора способа использования стека
void print_stack_type_menu(void)
{
    printf("\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("    |                   Выбор реализации стека                  |\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("    | 0 - Назад.                                                |\n");
    printf("    | 1 - Статический массив.                                   |\n");
    printf("    | 2 - Односвязный список.                                   |\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("Выбор: ");
}

// Функция вывода меню для взаимодействия со стеком
void print_operation_menu(int stack_type)
{
    printf("\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("    |                      Операции со стеком                   |\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("    | 0 - Назад.                                                |\n");
    printf("    | 1 - Добавить элемент.                                     |\n");
    printf("    | 2 - Удалить элемент.                                      |\n");
    printf("    | 3 - Отсортировать два стека с помощью третьего.           |\n");
    printf("    | 4 - Просмотр содержимого стека.                           |\n");
    if (stack_type == 2) 
    {
        printf("    | 5 - Просмотр стека с адресами.                            |\n");
        printf("    | 6 - История удаленных элементов.                          |\n");
    }
    printf("    +-----------------------------------------------------------+\n");
    printf("       // Максимальное количество элементов в стеке: %7d\n", MAX_SIZE);
    printf("Выбор: ");
}
