#include <stdio.h>

void print_menu(void)
{
    printf("\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("    |                           МЕНЮ                            |\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("    | 1 - Очередь-массив: Добавить элемент.                     |\n");
    printf("    | 2 - Очередь-массив: Удалить элемент.                      |\n");
    printf("    | 3 - Очередь-массив: Вывести очередь.                      |\n");
    printf("    | 4 - Очередь-массив: Моделирование очереди.                |\n");
    printf("    |~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|\n");
    printf("    | 5 - Очередь-список: Добавить элемент.                     |\n");
    printf("    | 6 - Очередь-список: Удалить элемент.                      |\n");
    printf("    | 7 - Очередь-список: Вывести очередь.                      |\n");
    printf("    | 8 - Очередь-список: Вывод использованных адресов.         |\n");
    printf("    | 9 - Очередь-список: Моделирование очереди.                |\n");
    printf("    |~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|\n");
    printf("    | 10 - Замерный эксперимент.                                |\n");
    printf("    |~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|\n");
    printf("    | 0 - Выход из программы.                                   |\n");
    printf("    +-----------------------------------------------------------+\n");
    printf("Выбор операции: ");
}